In [1]:
%load_ext sql
%sql mysql+mysqlconnector://blackbasil:Naveen%402193@localhost/de_project

In [2]:
%%sql
show tables;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
9 rows affected.

[('CustomerData',),
 ('CustomerDetails',),
 ('CustomerTransactions',),
 ('customers',),
 ('emp_123',),
 ('employees',),
 ('high_earners',),
 ('high_paid_employees',),
 ('orders',)]

In [9]:
%%sql
drop table if exists orders;
drop table  if exists restaurants;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql

CREATE TABLE restaurants (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    location VARCHAR(100)
);

CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    restaurant_id INT,
    order_date DATE,
    FOREIGN KEY (restaurant_id) REFERENCES restaurants(id)
);

INSERT INTO restaurants (id, name, location) VALUES
(1, 'The Spice Hub', 'New York'),
(2, 'Ocean Grill', 'Los Angeles'),
(3, 'Mountain Feast', 'Denver'),
(4, 'Urban Bite', 'Chicago'),
(5, 'Sunset Dine', 'Miami');

INSERT INTO orders (order_id, restaurant_id, order_date) VALUES
(101, 1, '2025-06-01'),
(102, 2, '2025-06-03'),
(103, 1, '2025-06-05'),
(104, 4, '2025-06-10'),
(105, 5, '2025-06-15'),
(106, 3, '2025-06-20');

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.
0 rows affected.
5 rows affected.
6 rows affected.

[]

In [13]:
%%sql

select r.name as restaurant_name,
o.order_date
from restaurants r
right join orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
6 rows affected.

[('The Spice Hub', datetime.date(2025, 6, 1)),
 ('Ocean Grill', datetime.date(2025, 6, 3)),
 ('The Spice Hub', datetime.date(2025, 6, 5)),
 ('Urban Bite', datetime.date(2025, 6, 10)),
 ('Sunset Dine', datetime.date(2025, 6, 15)),
 ('Mountain Feast', datetime.date(2025, 6, 20))]

In [14]:
%%sql

select 
    e.name as employee_name,
    m.name as manager_name
from employee e
left join employees m 
on e.manager_id_id = m.id;

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
(mysql.connector.errors.ProgrammingError) 1146 (42S02): Table 'de_project.employee' doesn't exist
[SQL: select
    e.name as employee_name,
    m.name as manager_name
from employee e
left join employees m
on e.manager_id_id = m.id;]
(Background on this error at: https://sqlalche.me/e/20/f405)